Tekla Open API Reference for Tekla Structures 2025
ModelObject.CompareTo Method
 Compares Identifiers of model objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CompareTo(
	Object obj
)
Public Function CompareTo (
	obj As Object
) As Integer
Parameters
obj
Type: System.Object
The model object to be used in comparison.
Return Value
Type: Int32
0 if object Identifiers are the same, 1 if given object Identifier is bigger, -1 otherwise.
Implements
IComparable.CompareTo(Object)
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace